In [49]:
import os
import pandas as pd

base_path = os.path.join("yob")

data = pd.DataFrame()

for year in range(1916, 2015):
    year_data = pd.read_csv(base_path+str(year)+".txt",
                            header=None,
                            names=["Name", "Gender", "Count"])
    year_data.insert(1, "Year", year)
    data = pd.concat([data, year_data])

data.insert(0, "Id", list(range(1, len(data)+1)))
data.to_csv("NationalNames.csv", index=False)

In [50]:
data = pd.read_csv('NationalNames.csv')
data.head()

   Id      Name  Year Gender  Count
0   1      Mary  1916      F  61437
1   2     Helen  1916      F  32661
2   3   Dorothy  1916      F  27415
3   4  Margaret  1916      F  24952
4   5      Ruth  1916      F  23189

In [51]:
data = data.drop('Count', 1)
data = data.drop('Id', 1)
data = data.drop('Year', 1)

In [52]:
data.head()

       Name Gender
0      Mary      F
1     Helen      F
2   Dorothy      F
3  Margaret      F
4      Ruth      F

In [53]:
data = data.replace({'F': 'female'}, regex=True)
data = data.replace({'M': 'male'}, regex=True)

In [54]:
data.head()

          Name  Gender
0      maleary  female
1        Helen  female
2      Dorothy  female
3  maleargaret  female
4         Ruth  female

In [55]:
data.to_csv("ssa_natl_names.csv", index=False, header=False)

In [56]:
df = pd.read_csv('ssa_natl_names.csv', header=None)
df.head()

             0       1
0      maleary  female
1        Helen  female
2      Dorothy  female
3  maleargaret  female
4         Ruth  female